<div class="row">
        <div class="col-lg-9">
            <h1>570.Managers with at Least 5 Direct Reports</h1>
            <div class="markdown-body" style="margin-top: 20px">
                <p>The <code>Employee6</code> table holds all employees including their managers. Every employee has an Id, and there is also a column for the manager Id.</p>

<pre>
+------+----------+-----------+----------+
|Id    |Name 	  |Department |ManagerId |
+------+----------+-----------+----------+
|101   |John 	  |A 	      |null      |
|102   |Dan 	  |A 	      |101       |
|103   |James 	  |A 	      |101       |
|104   |Amy 	  |A 	      |101       |
|105   |Anne 	  |A 	      |101       |
|106   |Ron 	  |B 	      |101       |
+------+----------+-----------+----------+
</pre>

<p>Given the <code>Employee6</code> table, write a SQL query that finds out managers with at least 5 direct report. For the above table, your SQL query should return:</p>

<pre>
+-------+
| Name  |
+-------+
| John  |
+-------+
</pre>

<p><b>Note:</b><br />
No one would report to himself.</p>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
pd.read_sql_table("Employee6", engine)

    Id   Name Department ManagerId
0  101   John          A      None
1  102    Dan          A       101
2  103  James          A       101
3  104    Amy          A       101
4  105   Anne          A       101
5  106    Ron          B       101

In [8]:
## Method 1
query = '''
SELECT e.Name
FROM Employee6 e
WHERE e.Id IN (SELECT b.ManagerId
               FROM Employee6 b
               GROUP BY b.ManagerId
               HAVING COUNT(DISTINCT b.Id) >= 5);
'''
pd.read_sql_query(query, engine)

   Name
0  John

In [17]:
## Method 2
query = '''
SELECT e.Name
FROM Employee6 e
INNER JOIN Employee6 b
ON b.ManagerId = e.Id
GROUP BY e.Name
HAVING COUNT(DISTINCT b.Id) >= 5;
'''
pd.read_sql_query(query, engine)

   Name
0  John

## Note
# Time: O(n^2)
# Space: O(n)